# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import pandas as pd
import numpy as np
import matplotlib

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `temp_states`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
# your code here
temp = pd.read_csv('../data/Temp_States.csv')

#### Print `temp`.

In [3]:
# your code here
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [4]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [5]:
"""
your comments here
"""

'\nyour comments here\n'

#### Select the rows where state is New York.

In [6]:
# your code here
NewYork = temp[temp.State == 'New York']
NewYork

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [7]:
# your code here
NewYork.Temperature.mean()

10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [8]:
# your code here
hightemp = temp[temp.Temperature >= 15]
hightemp

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [9]:
# your code here
hightemp.City

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [10]:
# your code here
specify = hightemp[hightemp.Temperature <=20]
specify

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
6    Newark   New Jersey    20.000000

#### Find the mean and standard deviation of the temperature of each state.

In [11]:
# your code here
StatesTemp = temp.groupby(['State']).mean()
StatesTemp

             Temperature
State
Connecticut    15.833333
New Jersey     21.111111
New York       10.740741

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [12]:
# your code here
employees = pd.read_csv('../data/employee.csv')

#### Explore the data types of the `employees` dataframe. Comment your results.

In [13]:
# your code here
employees.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

In [14]:
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [15]:
"""
your comments here
"""

'\nyour comments here\n'

#### What's the average salary in this company?

In [16]:
# your code here
employees.Salary.mean()

48.888888888888886

#### What's the highest salary?

In [17]:
# your code here
employees.Salary.max()

70

#### What's the lowest salary?

In [18]:
# your code here
employees.Salary.min()

30

#### Who are the employees with the lowest salary?

In [19]:
# your code here
lowest = employees[employees.Salary == 30]
lowest

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [20]:
# your code here
David = employees[employees.Name == 'David']
David

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [21]:
# your code here
David.Salary

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [22]:
# your code here
Associates = employees[employees.Title == 'associate']
Associates

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [23]:
# Method 1
# your code here
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [24]:
# Method 2
# your code here
employees.loc[0:2]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [25]:
# your code here
Associates_rich = Associates[Associates.Salary > 55]
Associates_rich

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [26]:
# your code here
NumberYears = employees.groupby(['Years']).mean()
NumberYears

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [27]:
# your code here
AvTitle = employees.groupby(['Title']).mean()
AvTitle

           Years     Salary
Title
VP          8.00  70.000000
analyst     2.25  32.500000
associate   4.00  56.666667

####  Find the salary quartiles.

In [28]:
# your code here
employees.Salary.describe()

count     9.000000
mean     48.888889
std      16.541194
min      30.000000
25%      35.000000
50%      55.000000
75%      60.000000
max      70.000000
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [29]:
# your code here
SalGen = employees.groupby(['Gender']).mean()
SalGen

        Years  Salary
Gender
F         4.0    47.5
M         4.2    50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [30]:
# your code here
employees.describe()

          Years     Salary
count  9.000000   9.000000
mean   4.111111  48.888889
std    2.803767  16.541194
min    1.000000  30.000000
25%    2.000000  35.000000
50%    3.000000  55.000000
75%    7.000000  60.000000
max    8.000000  70.000000

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [31]:
# your code here

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `orders` dataset. Name your dataset `orders`.

In [32]:
# your code here
orders = pd.read_csv('../data/Orders.csv')

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [33]:
# your code here
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

In [34]:
orders.dtypes

Unnamed: 0        int64
InvoiceNo         int64
StockCode        object
year              int64
month             int64
day               int64
hour              int64
Description      object
Quantity          int64
InvoiceDate      object
UnitPrice       float64
CustomerID        int64
Country          object
amount_spent    float64
dtype: object

In [35]:
"""
your comments here
"""

'\nyour comments here\n'

####  What is the average purchase price?

In [36]:
# your code here
orders.amount_spent.mean()

22.394748504739596

#### What are the highest and lowest purchase prices?

In [37]:
# your code here
orders.amount_spent.min()

0.0

In [38]:
orders.amount_spent.max()

168469.6

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [39]:
# your code here
Spanish_Customers = orders[orders.Country == 'Spain'] 
Spanish_Customers.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
4250,6421,536944,22383,2010,12,5,12,lunch bag suki design,70,2010-12-03 12:20:00,1.65,12557,Spain,115.5
4251,6422,536944,22384,2010,12,5,12,lunch bag pink polkadot,100,2010-12-03 12:20:00,1.45,12557,Spain,145.0
4252,6423,536944,20727,2010,12,5,12,lunch bag black skull.,60,2010-12-03 12:20:00,1.65,12557,Spain,99.0
4253,6424,536944,20725,2010,12,5,12,lunch bag red retrospot,70,2010-12-03 12:20:00,1.65,12557,Spain,115.5
4254,6425,536944,20728,2010,12,5,12,lunch bag cars blue,100,2010-12-03 12:20:00,1.45,12557,Spain,145.0

In [58]:
Grouped_Spanish = pd.DataFrame(Spanish_Customers.groupby(['CustomerID']).sum())
Grouped_Spanish

,Unnamed: 0,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,amount_spent
CustomerID,,,,,,,,,
12354,9645139,31952838,116638,232,232,754,530,261.22,1079.40
12417,3938336,12682154,46253,92,92,299,267,72.05,436.30
12421,11812978,25167687,90495,282,178,538,484,203.41,807.04
12442,6377106,6971460,24132,144,24,168,182,40.08,172.06
12445,1915882,2308500,8044,44,16,72,62,31.95,133.40
12448,9246897,12603492,44242,220,66,286,243,130.94,449.45
12450,1898462,4462114,16088,50,48,112,128,12.94,197.88
12454,5979495,8568825,30165,150,75,255,1006,109.23,3528.34
12455,13890841,26985556,96528,366,156,626,566,177.24,767.96
12462,14130247,34448972,124682,322,142,758,536,290.75,1189.59
12484,85792569,193177283,695806,2152,1907,4594,2191,1081.63,4541.72
12502,30624610,81550414,295617,829,455,1541,820,944.51,3723.87
12507,3672877,12122225,44242,89,49,263,905,102.12,1304.81
12510,2880312,17945667,66363,57,70,446,353,140.69,982.57
12538,9591414,12089847,42231,231,84,357,191,76.51,363.95
12539,37686629,149603034,549003,791,725,3123,2067,1140.19,5568.35
12540,125986292,267468854,961238,3408,1275,6050,6685,1838.89,13400.24
12541,15311094,29217735,104572,381,258,558,680,188.02,981.18
12544,8321696,10911719,38209,209,76,304,136,78.02,372.70
12545,10292383,27715724,100550,246,282,616,523,201.19,1000.39
12546,25951494,39297168,138759,645,249,693,633,220.75,1161.50
12547,1067536,4383466,16088,28,38,96,134,63.60,207.80
12548,1203340,2790540,10055,30,35,75,49,33.60,95.20
12550,19980381,32356221,114627,513,171,798,569,176.15,964.83
12551,343995,5393510,20100,120,50,110,100,16.80,168.00
12556,39443957,68389065,243331,1009,283,1573,358,322.14,603.71
12557,6640547,18284069,66358,228,65,443,4384,71.83,11990.96
12596,7177755,15107442,54297,180,51,351,474,118.95,618.27
12597,69567083,116542636,414266,1670,1178,2852,2236,812.07,3811.22
17097,66225108,118835244,424281,1992,604,3208,459,546.87,954.42

#### How many customers do we have in Spain?

In [41]:
# your code here
len(Grouped_Spanish)

30

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [55]:
# your code here df.groupby(['Animal']).mean()
Grouped_Customer = orders.groupby(['CustomerID']).sum()
Grouped_Customer.head()

,Unnamed: 0,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,amount_spent
CustomerID,,,,,,,,,
12346,61619,541431,2011,1,2,10,74215,1.04,77183.60
12347,42441700,101296926,365971,1383,441,2219,2458,481.21,4310.00
12348,2807120,16869685,62324,257,111,472,2341,178.71,1797.24
12349,35444274,42165457,146803,803,73,657,631,605.10,1757.55
12350,1365627,9231629,34187,34,51,272,197,65.30,334.40

In [56]:
morethan50 = Grouped_Customer[Grouped_Customer.Quantity > 50]
morethan50

,Unnamed: 0,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,amount_spent
CustomerID,,,,,,,,,
12346,61619,541431,2011,1,2,10,74215,1.04,77183.60
12347,42441700,101296926,365971,1383,441,2219,2458,481.21,4310.00
12348,2807120,16869685,62324,257,111,472,2341,178.71,1797.24
12349,35444274,42165457,146803,803,73,657,631,605.10,1757.55
12350,1365627,9231629,34187,34,51,272,197,65.30,334.40
...,...,...,...,...,...,...,...,...,...
18278,3262446,5116428,18099,81,18,99,66,29.55,173.90
18281,1560699,3895248,14077,42,49,70,54,39.36,80.82
18282,4642134,6838540,24132,116,60,146,103,62.39,178.05
18283,233950830,425704048,1520316,5503,2489,10346,1397,1220.93,2094.88
18287,21958901,39474556,140770,555,332,697,1586,104.55,1837.28

In [57]:
len(morethan50)

4091

#### Select orders from Spain that include more than 50 items.

In [60]:
# your code here
morethan50 = Grouped_Spanish[Grouped_Spanish.Quantity > 50]
morethan50

,Unnamed: 0,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,amount_spent
CustomerID,,,,,,,,,
12354,9645139,31952838,116638,232,232,754,530,261.22,1079.40
12417,3938336,12682154,46253,92,92,299,267,72.05,436.30
12421,11812978,25167687,90495,282,178,538,484,203.41,807.04
12442,6377106,6971460,24132,144,24,168,182,40.08,172.06
12445,1915882,2308500,8044,44,16,72,62,31.95,133.40
12448,9246897,12603492,44242,220,66,286,243,130.94,449.45
12450,1898462,4462114,16088,50,48,112,128,12.94,197.88
12454,5979495,8568825,30165,150,75,255,1006,109.23,3528.34
12455,13890841,26985556,96528,366,156,626,566,177.24,767.96
12462,14130247,34448972,124682,322,142,758,536,290.75,1189.59
12484,85792569,193177283,695806,2152,1907,4594,2191,1081.63,4541.72
12502,30624610,81550414,295617,829,455,1541,820,944.51,3723.87
12507,3672877,12122225,44242,89,49,263,905,102.12,1304.81
12510,2880312,17945667,66363,57,70,446,353,140.69,982.57
12538,9591414,12089847,42231,231,84,357,191,76.51,363.95
12539,37686629,149603034,549003,791,725,3123,2067,1140.19,5568.35
12540,125986292,267468854,961238,3408,1275,6050,6685,1838.89,13400.24
12541,15311094,29217735,104572,381,258,558,680,188.02,981.18
12544,8321696,10911719,38209,209,76,304,136,78.02,372.70
12545,10292383,27715724,100550,246,282,616,523,201.19,1000.39
12546,25951494,39297168,138759,645,249,693,633,220.75,1161.50
12547,1067536,4383466,16088,28,38,96,134,63.60,207.80
12550,19980381,32356221,114627,513,171,798,569,176.15,964.83
12551,343995,5393510,20100,120,50,110,100,16.80,168.00
12556,39443957,68389065,243331,1009,283,1573,358,322.14,603.71
12557,6640547,18284069,66358,228,65,443,4384,71.83,11990.96
12596,7177755,15107442,54297,180,51,351,474,118.95,618.27
12597,69567083,116542636,414266,1670,1178,2852,2236,812.07,3811.22
17097,66225108,118835244,424281,1992,604,3208,459,546.87,954.42

In [61]:
len(morethan50)

29

#### Select all free orders.

In [44]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [45]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [46]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [47]:
# your code here

#### Select all orders made in the month of August.

In [48]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [49]:
# your code here

#### What's the  average amount of money spent by country?

In [50]:
# your code here

#### What's the most expensive item?

In [51]:
# your code here

#### What is the average amount spent per year?

In [52]:
# your code here